#include<stdio.h>
/*
	一维数组：数据类型 数组名[数组大小]
		  + 数组里面的每个元素是什么？ 定义的时候，是什么数据类型，那么每个元素就是什么类型
		  int ages[5];   ->int
	二维数组:数组类型  数组名[row][col]
		  + 数组的每个元素都是一个一维数组，这个一维数组里面存储的就是定义时候的类型
		  int arr[3][4];  ->arr[]   ->int

	内存大小:sizeof(数组名)

*/
int main二维数组初始化()
{
	//初始化方式
	//int arr[3][4] = { 0 };
	
	//推荐使用这种方式初始化二维数组，方便观看
	//int arr[3][4] = 
	//{ 
	//	{0,1,2,3},
	//	{0,1,9,3},
	//	{0,1,8,3} 
	//};

	//int arr[3][4] = { 8,9,5,1,5,7,72,8,7,125,4,45};
	/*
		0 8 9 5 1
		1 5 7 72 8
		2 7 124 4 45
	*/

	//int arr[3][4] = { {8,9,5},{1,5,7,72},8 };

	//省略大小
	//二维数组允许省略行数 
	//int arr[][4] = { 1,2,3,4,5,6,7,8,9 };
	/*
		0 1 2 3 4
		1 5 6 7 8
		2 9 0 0 0
	*/
	//int arr[][4] = { {1,2},{3,4,5},{6},{7,8},9 };
	/*
		0 1 2 0 0
		1 3 4 5 0
		2 6 0 0 0
		3 7 8 0 0
		4 9 0 0 0	
	*/
	//二维数组不允许省略列数
	//int arr[3][] = { 1,2,3,4,5,6,7,8,9 };	//编译器不知道如何去分列
	/*
		0 1 2 3 4
		1 5 6 7 8
		2 9 0 0 0

		0 1 2 3 4 5
		1 6 7 8 9 0
		2 0 0 0 0 0
	*/



	//全部输出
	for (int k = 0; k < 3; k++)
	{
		for (int i = 0; i < 4; i++)
		{
			//printf("%d ", arr[k][i]);
		}
		printf("\n");
	}

	


	return 0;
}

int main()
{
	//int map[3][3][3] = {0};
	int map[3][3][3] = 
	{  
		{
			{1,2,3},
			{1,2,3},
			{1,2,3}
		},
		{
			{4,5,6},
			{4,5,6},
			{4,5,6}
		},
		{
			{7,8,9},
			{7,8,9},
			{7,8,9}
		}
	};


	//遍历三维数组
	for (int level = 0; level < 3; level++)
	{
		printf("\n--%d--\n",level);
		for (int i = 0; i < 3; i++)
		{
			for (int k = 0; k < 3; k++)
			{
				printf("%d ", map[level][i][k]);
			}
			printf("\n");
		}
		
	}




	return 0;
}